# CustomInitialColor Constructor (Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomInitialColor Constructor (Double)
CustomInitialColor Class See Also
---
Creates a custom initial color set to the given color
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CustomInitialColor(
	double temperature
)
```

Visual Basic
---
```text
Public Sub New ( _
	temperature As Double _
)
```

Visual C++
---
```text
public:
CustomInitialColor(
	double temperature
)
```

# ### Parameters
temperature
    Type: System..::..Double The color temperature in Kelvin as a numerical value between 1800 and 20000
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The color temperature is not valid because it is not in the range of 1800 to 20000. |

# See Also
CustomInitialColor Class
CustomInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace